Revit 2027 API
ClipPlane.Origin Property
 The plane's origin.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; set; }
Public Property Origin As XYZ
	Get
	Set
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Origin : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace